Vulintus/Vulintus_Board_Definitions/hardware/samd/0.1.0/variants/omnitrak_controller_v2_1/variant.h
#define PIN_V_IN_ADC        PIN_A0        //24V power supply voltage monitor.
#define PIN_I_IN_ADC        PIN_A1        //24V power supply current monitor.
#define PIN_9V_UVLO         PIN_A2        //Under-voltage lock-out level on the 9V power supply.
#define PIN_9V_ADC          PIN_A3        //9V power supply voltage monitor.
#define PIN_5V_ADC          PIN_A4        //9V power supply voltage monitor.

#define PIN_P1_IOUT         PIN_A5        //OTMP Port 1 current monitor.
#define PIN_P2_IOUT         PIN_A6        //OTMP Port 2 current monitor.
#define PIN_P3_IOUT         PIN_A7        //OTMP Port 3 current monitor.
#define PIN_P4_IOUT         PIN_A8        //OTMP Port 4 current monitor.
#define PIN_P5_IOUT         PIN_A9        //OTMP Port 5 current monitor.

#define PIN_BNC_OUT_1       PIN_DAC0      //BNC digital-to-analog output #1.
#define PIN_BNC_OUT_2       PIN_DAC1      //BNC digital-to-analog output #2.
#define PIN_BNC_IN_1        PIN_A12       //BNC analog-to-digital input #1.
#define PIN_BNC_IN_2        PIN_A13       //BNC analog-to-digital input #2.

#define PIN_BOARD_ID        PIN_A14       //Board ID analog reference.


/*
 * Digital pins
 */

// Vulintus Peripheral Bus (VPB)
#define PIN_VPB_CLK_IN      (13u)         //PB02
#define PIN_VPB_CLK_OUT     (14u)         //PB01
#define PIN_VPB_TRG         (15u)         //PB00
#define PIN_VPB_BLOCK       (16u)         //PB03

// NINA W102 Module
#define PIN_NINA_RST        (17u)         //PC10
#define PIN_NINA_CS         (18u)         //PA06 
#define PIN_NINA_DEBUG      (19u)         //PA01
#define PIN_NINA_ACK        (20u)         //PA07
#define PIN_NINA_BOOT       (21u)         //PC07
#define NINA_GPIO0          PIN_NINA_BOOT
#define NINA_RESETN         PIN_NINA_RST
#define NINA_ACK            PIN_NINA_ACK

// TFT Display
#define PIN_TFT_RST         (26u)         //PC13
#define PIN_TFT_LED         (27u)         //PC11
#define PIN_TFT_DC          (28u)         //PB13
#define PIN_TFT_CS          (29u)         //PC14
#define TFT_RST             PIN_TFT_RST
#define TFT_LED             PIN_TFT_LED
#define TFT_DC              PIN_TFT_DC
#define TFT_CS              PIN_TFT_CS
#define TFT_WIDTH           160
#define TFT_HEIGHT          128
#define TFT_ROTATION        1

// RV-3208-C7 Real-Time Clock
#define PIN_RTC_INT         (33u)         //PC15
#define PIN_RTC_EVI         (34u)         //PA14
#define PIN_RTC_CLKO        (35u)         //PA00

// User Input
#define PIN_ENC_SW          (36u)         //PD10
#define PIN_ENC_A           (37u)         //PD09
#define PIN_ENC_B           (38u)         //PD08
#define PIN_QT_RST          (39u)         //PB12
#define PIN_QT_INT          (40u)         //PA04

// Piezo Speaker
#define PIN_SPKR            (45u)         //PB14

// Power Control
#define PIN_PWR_SHDN        (51u)         //PB17
#define PIN_I_IN_RESET      (52u)         //PB16
#define PIN_PWR_FAULT       (53u)         //PD21
#define PIN_9V_ON_FLAG      (54u)         //PD20

// OTMP Power Control
#define PIN_P1_24V_EN       (65u)         //PB19
#define PIN_P2_24V_EN       (66u)         //PB21
#define PIN_P3_24V_EN       (67u)         //PA21
#define PIN_P4_24V_EN       (68u)         //PB29
#define PIN_P5_24V_EN       (69u)         //PA27
#define PIN_P1_ALERT        (75u)         //PB26
#define PIN_P2_ALERT        (76u)         //PB27
#define PIN_P3_ALERT        (77u)         //PB28
#define PIN_P4_ALERT        (78u)         //PC24
#define PIN_P5_ALERT        (79u)         //PC25
#define PIN_P1_RST          (80u)         //PB20
#define PIN_P2_RST          (81u)         //PA20
#define PIN_P3_RST          (82u)         //PB23
#define PIN_P4_RST          (83u)         //PC26
#define PIN_P5_RST          (84u)         //PC03

// BNC I/O
#define PIN_BNC_SW_1        (89u)         //PC18
#define PIN_BNC_SW_2        (90u)         //PC19
#define PIN_BNC_EN_1        (91u)         //PC20
#define PIN_BNC_EN_2        (92u)         //PC21

// Fan Control
#define PIN_FAN             (93u)         //PA19


/*
 * Serial interfaces
 */

// Serial1, OTMP Port 1 (SERCOM0)
#define PIN_SERIAL1_TX      (55ul)        //PC17
#define PIN_SERIAL1_RX      (56ul)        //PC16
#define PAD_SERIAL1_TX      (UART_TX_PAD_0)
#define PAD_SERIAL1_RX      (SERCOM_RX_PAD_1)
#define SERCOM_SERIAL1		  sercom0

// Serial2, OTMP Port 2 (SERCOM3)
#define PIN_SERIAL2_TX      (57ul)        //PC23
#define PIN_SERIAL2_RX      (58ul)        //PC22
#define PAD_SERIAL2_TX      (UART_TX_PAD_0)
#define PAD_SERIAL2_RX      (SERCOM_RX_PAD_1)
#define SERCOM_SERIAL2		  sercom3

// Serial3, OTMP Port 3 (SERCOM5)
#define PIN_SERIAL3_TX      (59ul)        //PA23
#define PIN_SERIAL3_RX      (60ul)        //PA22
#define PAD_SERIAL3_TX      (UART_TX_PAD_0)
#define PAD_SERIAL3_RX      (SERCOM_RX_PAD_1)
#define SERCOM_SERIAL3		  sercom5

// Serial4, OTMP Port 4 (SERCOM2)
#define PIN_SERIAL4_TX      (61ul)        //PB25
#define PIN_SERIAL4_RX      (62ul)        //PB24
#define PAD_SERIAL4_TX      (UART_TX_PAD_0)
#define PAD_SERIAL4_RX      (SERCOM_RX_PAD_1)
#define SERCOM_SERIAL4		  sercom2

// Serial5, OTMP Port 5 (SERCOM7)
#define PIN_SERIAL5_TX      (63ul)        //PC12
#define PIN_SERIAL5_RX      (64ul)        //PB31
#define PAD_SERIAL5_TX      (UART_TX_PAD_0)
#define PAD_SERIAL5_RX      (SERCOM_RX_PAD_1)
#define SERCOM_SERIAL5		  sercom7

// Serial6, NINA Programming Serial (SERCOM6)
#define PIN_SERIAL6_TX      (23ul)        //PC04
#define PIN_SERIAL6_RX      (22ul)        //PC05
#define PAD_SERIAL6_TX      (UART_TX_PAD_0)
#define PAD_SERIAL6_RX      (SERCOM_RX_PAD_1)
#define SERCOM_SERIAL6		  sercom6


/*
 * SPI Interfaces
 */
#define SPI_INTERFACES_COUNT 1

#define PIN_SPI_MOSI        (0u)         //PC27 (S1.0)
#define PIN_SPI_MISO        (1u)         //PB22 (SA1.2) ????????????????????????????
#define PIN_SPI_SCK         (2u)         //PC28 (S1.1)
#define PERIPH_SPI          sercom1
#define PAD_SPI_TX          SPI_PAD_0_SCK_1       //?!?!
#define PAD_SPI_RX          SERCOM_RX_PAD_2       //?!?!

